main/InformationRegisters/ПрививкиВОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПрививкиВОчереди</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозрастВакцинации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Лет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ребенок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дети</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инфекция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инфекции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вакцина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакцины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВакцинации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

main/InformationRegisters/ПрививкиВОчереди/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	Оповестить("ОбновитьФормуНачальнойСтраницы");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РебенокПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ДатаВакцинации) Тогда
		Запись.ВозрастВакцинации = ПолучитьВозрастВакцинации(Запись.Ребенок, Запись.ДатаВакцинации);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ВозрастВакцинации) Тогда
		Запись.ДатаВакцинации = ПолучитьДатуВакцинации(Запись.Ребенок, Запись.ВозрастВакцинации);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВозрастВакцинацииПриИзменении(Элемент)
	
	Запись.ДатаВакцинации = ПолучитьДатуВакцинации(Запись.Ребенок, Запись.ВозрастВакцинации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВакцинацииПриИзменении(Элемент)
	
	Запись.ВозрастВакцинации = ПолучитьВозрастВакцинации(Запись.Ребенок, Запись.ДатаВакцинации);
	
КонецПроцедуры

&НаКлиенте
Процедура ВакцинаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", ПолучитьДоступныеВакциныПоИнфекции(Запись.Инфекция));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.Вакцины.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛетПриИзменении(Элемент)
	
	РассчитатьВозрастДатуВакцинации();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцевПриИзменении(Элемент)
	
	РассчитатьВозрастДатуВакцинации();
	
КонецПроцедуры

&НаКлиенте
Процедура НедельПриИзменении(Элемент)
	
	РассчитатьВозрастДатуВакцинации();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуВакцинации(Ребенок, ВозрастВакцинации)
	
	ДатаРождения = ОбщегоНазначенияПовтИсп.ПолучитьДатуРожденияРебенка(Ребенок);
	
	Возврат ОбщегоНазначенияСервер.ПолучитьДатуВакцинацииПоДатеРождения(ДатаРождения, ВозрастВакцинации); 	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВозрастВакцинации(Ребенок, ДатаВакцинации)
	
	ДатаРождения = ОбщегоНазначенияПовтИсп.ПолучитьДатуРожденияРебенка(Ребенок);
	
	Возврат ОбщегоНазначенияСервер.ПолучитьВозрастВакцинацииПоДатеРождения(ДатаРождения, ДатаВакцинации); 	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДоступныеВакциныПоИнфекции(Инфекция)
	
	Возврат ОбщегоНазначенияСервер.ПолучитьДоступныеВакциныПоИнфекции(Инфекция);
	
КонецФункции

&НаКлиенте
Процедура РассчитатьВозрастДатуВакцинации()
	
	Запись.ВозрастВакцинации = (Запись.Лет * 12) + Запись.Месяцев + (Запись.Недель / 10);
	
	Запись.ДатаВакцинации = ПолучитьДатуВакцинации(Запись.Ребенок, Запись.ВозрастВакцинации);
	
КонецПроцедуры

#КонецОбласти
